[Killed] ArrowFunction
main/pages/Admin/AdminJobsPage.js:37:43
 
   // ***** update courses job *******
 
-  const objectToAxiosParamsClearJobLogs = () => ({
-    url: "/api/jobs/all",
-    method: "DELETE",
-  });
+  const objectToAxiosParamsClearJobLogs = () => undefined;
 
   const objectToAxiosParamsUpdateCoursesJob = (data) => ({
killedBy: AdminJobsPage tests user can clear job logs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/Admin/AdminJobsPage.js:92:36
   );
   // Stryker restore all
 
-  const clearJobLogs = async () => {
-    clearJobLogsMutation.mutate();
-  };
+  const clearJobLogs = async () => {};
 
   const submitUpdateCoursesJob = async (data) => {
killedBy: AdminJobsPage tests user can clear job logs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
