[Killed] BlockStatement
main/components/Jobs/ClearJobLogsForm.js:3:44
 import { Form, Button, Container, Row, Col } from "react-bootstrap";
 
-const ClearJobLogsForm = ({ callback }) => {
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback();
-  };
-  // Stryker disable all
-  return (
-    <Form onSubmit={handleSubmit}>
-      <Container>
-        <Row style={{ paddingTop: 8, paddingBottom: 8 }}>
-          <Col md="auto">
-            <Button
-              variant="danger"
-              type="submit"
-              data-testid="clearJobLogsButn"
-            >
-              Clear Jobs
-            </Button>
-          </Col>
-        </Row>
-      </Container>
-    </Form>
-  );
-};
+const ClearJobLogsForm = ({ callback }) => {};
 
 export default ClearJobLogsForm;
killedBy: AdminJobsPage tests user can clear job logs
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="clearJobLogsButn"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/components/Jobs/ClearJobLogsForm.js:4:35
 import { Form, Button, Container, Row, Col } from "react-bootstrap";
 
 const ClearJobLogsForm = ({ callback }) => {
-  const handleSubmit = (event) => {
-    event.preventDefault();
-    callback();
-  };
+  const handleSubmit = (event) => {};
   // Stryker disable all
   return (
killedBy: AdminJobsPage tests user can clear job logs
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
