[Killed] ObjectLiteral
main/pages/Jobs/JobsLogPage.js:17:39
     data: jobs,
     _error,
     _status,
-  } = useBackend([`/api/jobs/${id}`], {
-    method: "GET",
-    url: `/api/jobs/all`,
-  });
+  } = useBackend([`/api/jobs/${id}`], {});
 
   const job = jobs ? jobs.find((job) => String(job.id) === id) : null;
killedBy: JobsLogPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Job Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/Jobs/JobsLogPage.js:22:41
     url: `/api/jobs/all`,
   });
 
-  const job = jobs ? jobs.find((job) => String(job.id) === id) : null;
+  const job = jobs ? jobs.find((job) => String(job.id) !== id) : null;
 
   // Navigate back to the jobs table
killedBy: JobsLogPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Job Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/Jobs/JobsLogPage.js:22:32
     url: `/api/jobs/all`,
   });
 
-  const job = jobs ? jobs.find((job) => String(job.id) === id) : null;
+  const job = jobs ? jobs.find(() => undefined) : null;
 
   // Navigate back to the jobs table
killedBy: JobsLogPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Job Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Survived] BlockStatement
main/pages/Jobs/JobsLogPage.js:25:34
   const job = jobs ? jobs.find((job) => String(job.id) === id) : null;
 
   // Navigate back to the jobs table
-  const navigateCallback = () => {
-    navigate("/admin/jobs");
-  };
+  const navigateCallback = () => {};
 
   return (

[Survived] StringLiteral
main/pages/Jobs/JobsLogPage.js:26:14
 
   // Navigate back to the jobs table
   const navigateCallback = () => {
-    navigate("/admin/jobs");
+    navigate("");
   };
 
