[Killed] BlockStatement
main/pages/Admin/AdminUpdatesPage.js:3:44
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function AdminUpdatesPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <h1>Updates page not yet implemented</h1>
-    </BasicLayout>
-  );
-}
+export default function AdminUpdatesPage() {}
killedBy: AdminUpdatesPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Updates page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
