[Killed] BlockStatement
main/components/Jobs/JobsTable.js:8:32
 export default function JobsTable({ jobs }) {
   const testid = "JobsTable";
 
-  const truncateLog = (log) => {
-    if (log) {
-      const lines = log.split("\n");
-
-      //not able to test for tags. \n gets stripped in html output
-      //Stryker disable all
-      return lines.slice(0, 10).join("\n");
-      //Stryker restore all
-    }
-    console.log("empty");
-    return "";
-  };
+  const truncateLog = (log) => {};
 
   const columns = [
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:9:14
   const testid = "JobsTable";
 
   const truncateLog = (log) => {
-    if (log) {
-      const lines = log.split("\n");
-
-      //not able to test for tags. \n gets stripped in html output
-      //Stryker disable all
-      return lines.slice(0, 10).join("\n");
-      //Stryker restore all
-    }
+    if (log) {}
     console.log("empty");
     return "";
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] ConditionalExpression
main/components/Jobs/JobsTable.js:9:9
   const testid = "JobsTable";
 
   const truncateLog = (log) => {
-    if (log) {
+    if (true) {
       const lines = log.split("\n");
 
killedBy: JobsTable tests Handles empty logs gracefully
statusReason: TypeError: Cannot read properties of null (reading 'split')
