[Killed] ConditionalExpression
main/pages/Jobs/JobsLogPage.js:28:41
   };
   // Stryker restore all
 
-  const job = jobs ? jobs.find((job) => String(job.id) === id) : null;
+  const job = jobs ? jobs.find((job) => true) : null;
 
   return (
killedBy: JobsLogPage tests renders invalid job correctly
statusReason: Error: Unable to find an element with the text: Job not found.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/Jobs/JobsLogPage.js:28:41
   };
   // Stryker restore all
 
-  const job = jobs ? jobs.find((job) => String(job.id) === id) : null;
+  const job = jobs ? jobs.find((job) => false) : null;
 
   return (
killedBy: JobsLogPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Job Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
