[Killed] BooleanLiteral
main/components/Jobs/JobsLogTable.js:8:7
   const testid = "JobLogTable";
 
   // Ensure job and log data are present
-  if (!job) {
+  if (job) {
     return <p data-testid={`${testid}-not-found`}>Job not found.</p>;
   }
killedBy: JobsLogPage tests renders without crashing
statusReason: TypeError: Cannot read properties of null (reading 'log')

[Killed] ConditionalExpression
main/components/Jobs/JobsLogTable.js:8:7
   const testid = "JobLogTable";
 
   // Ensure job and log data are present
-  if (!job) {
+  if (true) {
     return <p data-testid={`${testid}-not-found`}>Job not found.</p>;
   }
killedBy: JobsLogPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: Job Log. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Jobs/JobsLogTable.js:9:28
 
   // Ensure job and log data are present
   if (!job) {
-    return <p data-testid={`${testid}-not-found`}>Job not found.</p>;
+    return <p data-testid={``}>Job not found.</p>;
   }
 
killedBy: JobsLogTable tests renders without crashing for empty table
statusReason: Error: Unable to find an element by: [data-testid="JobLogTable-not-found"]

Ignored nodes: comments, script, style
<body>
  <div>
    <p
      data-testid=""
    >

[Killed] ArrowFunction
main/components/Jobs/JobsLogTable.js:14:32
 
   const logLines = job.log ? job.log.split("\n") : [];
 
-  const logData = logLines.map((line, index) => ({
-    index: index + 1,
-    logLine: line,
-  }));
+  const logData = logLines.map(() => undefined);
 
   const logColumns = [
killedBy: JobsLogTable tests Has the expected column headers and content
statusReason: Error: Invalid data value

[Killed] ArithmeticOperator
main/components/Jobs/JobsLogTable.js:15:12
   const logLines = job.log ? job.log.split("\n") : [];
 
   const logData = logLines.map((line, index) => ({
-    index: index + 1,
+    index: index - 1,
     logLine: line,
   }));
killedBy: JobsLogTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2
Received:
  0

[Killed] ObjectLiteral
main/components/Jobs/JobsLogTable.js:31:5
   ];
 
   const jobData = [
-    { field: "ID", value: job.id },
+    {},
     { field: "Created", value: new Date(job.createdAt).toLocaleString() },
     { field: "Updated", value: new Date(job.updatedAt).toLocaleString() },
killedBy: JobsLogTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h3>
        Job Information

[Killed] StringLiteral
main/components/Jobs/JobsLogTable.js:32:14
 
   const jobData = [
     { field: "ID", value: job.id },
-    { field: "Created", value: new Date(job.createdAt).toLocaleString() },
+    { field: "", value: new Date(job.createdAt).toLocaleString() },
     { field: "Updated", value: new Date(job.updatedAt).toLocaleString() },
     { field: "Status", value: job.status },
killedBy: JobsLogTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Created. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h3>
        Job Information

[Killed] ObjectLiteral
main/components/Jobs/JobsLogTable.js:34:5
     { field: "ID", value: job.id },
     { field: "Created", value: new Date(job.createdAt).toLocaleString() },
     { field: "Updated", value: new Date(job.updatedAt).toLocaleString() },
-    { field: "Status", value: job.status },
+    {},
   ];
 
killedBy: JobsLogPage tests renders job details correctly
statusReason: Error: Unable to find an element with the text: complete. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Jobs/JobsLogTable.js:39:15
 
   const jobColumns = [
     {
-      Header: "Field",
+      Header: "",
       accessor: "field",
     },
killedBy: JobsLogTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Field. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h3>
        Job Information

[Killed] StringLiteral
main/components/Jobs/JobsLogTable.js:40:17
   const jobColumns = [
     {
       Header: "Field",
-      accessor: "field",
+      accessor: "",
     },
     {
killedBy: JobsLogPage tests renders without crashing
statusReason: Error: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/Jobs/JobsLogTable.js:43:15
       accessor: "field",
     },
     {
-      Header: "Value",
+      Header: "",
       accessor: "value",
     },
killedBy: JobsLogTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Value. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <h3>
        Job Information
