[Killed] BlockStatement
main/components/Jobs/JobsTable.js:5:38
 import OurTable, { DateColumn } from "main/components/OurTable";
 import { Link } from "react-router-dom";
 
-export function truncateLines(lines) {
-  return lines.slice(0, 10).join("\n");
-}
+export function truncateLines(lines) {}
 
 export default function JobsTable({ jobs }) {
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] MethodExpression
main/components/Jobs/JobsTable.js:6:10
 import { Link } from "react-router-dom";
 
 export function truncateLines(lines) {
-  return lines.slice(0, 10).join("\n");
+  return lines.join("\n");
 }
 
killedBy: JobsTable tests Truncates logs longer than 10 lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 0
+ Received  + 5

@@ -5,6 +5,11 @@
  Log
  Log

[Killed] StringLiteral
main/components/Jobs/JobsTable.js:6:34
 import { Link } from "react-router-dom";
 
 export function truncateLines(lines) {
-  return lines.slice(0, 10).join("\n");
+  return lines.slice(0, 10).join("");
 }
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:
  Hello World! from test job!Goodbye from test job!

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:12:32
 export default function JobsTable({ jobs }) {
   const testid = "JobsTable";
 
-  const truncateLog = (log) => {
-    if (log) {
-      const lines = log.split("\n");
-      return truncateLines(lines);
-    }
-    return "";
-  };
+  const truncateLog = (log) => {};
 
   const columns = [
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:13:14
   const testid = "JobsTable";
 
   const truncateLog = (log) => {
-    if (log) {
-      const lines = log.split("\n");
-      return truncateLines(lines);
-    }
+    if (log) {}
     return "";
   };
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] ObjectLiteral
main/components/Jobs/JobsTable.js:31:5
       Header: "Status",
       accessor: "status",
     },
-    {
-      Header: "Log",
-      Cell: ({ cell }) => {
-        const log = cell.row.original.log;
-        const id = cell.row.original.id;
-        const truncatedLog = truncateLog(log);
-        return (
-          <div>
-            <pre>{truncatedLog}</pre>
-            {log && log.split("\n").length > 10 && (
-              <div>
-                <pre>...</pre>
-                <Link
-                  to={`/admin/jobs/logs/${id}`}
-                  data-testid={`${testid}-see-entire-log-${id}`}
-                >
-                  [See entire log]
-                </Link>
-              </div>
-            )}
-          </div>
-        );
-      },
-    },
+    {},
   ];
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Jobs/JobsTable.js:33:27
     },
     {
       Header: "Log",
-      Cell: ({ cell }) => {
-        const log = cell.row.original.log;
-        const id = cell.row.original.id;
-        const truncatedLog = truncateLog(log);
-        return (
-          <div>
-            <pre>{truncatedLog}</pre>
-            {log && log.split("\n").length > 10 && (
-              <div>
-                <pre>...</pre>
-                <Link
-                  to={`/admin/jobs/logs/${id}`}
-                  data-testid={`${testid}-see-entire-log-${id}`}
-                >
-                  [See entire log]
-                </Link>
-              </div>
-            )}
-          </div>
-        );
-      },
+      Cell: ({ cell }) => {},
     },
   ];
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  Hello World! from test job! Goodbye from test job!
Received:

[Killed] EqualityOperator
main/components/Jobs/JobsTable.js:40:21
         return (
           <div>
             <pre>{truncatedLog}</pre>
-            {log && log.split("\n").length > 10 && (
+            {log && log.split("\n").length <= 10 && (
               <div>
                 <pre>...</pre>
killedBy: JobsTable tests Truncates logs longer than 10 lines
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -5,6 +5,6 @@
  Log
  Log

[Killed] LogicalOperator
main/components/Jobs/JobsTable.js:40:14
         return (
           <div>
             <pre>{truncatedLog}</pre>
-            {log && log.split("\n").length > 10 && (
+            {log || log.split("\n").length > 10 && (
               <div>
                 <pre>...</pre>
killedBy: JobsTable tests Does not truncate logs 10 lines or shorter
statusReason: Error: expect(received).toBe(expected) // Object.is equality

- Expected  - 1
+ Received  + 1

@@ -5,6 +5,6 @@
  Log
  Log

[Killed] ArrayDeclaration
main/components/Jobs/JobsTable.js:58:11
   ];
 
   const sortees = React.useMemo(
-    () => [
-      {
-        id: "id",
-        desc: true,
-      },
-    ],
+    () => [],
     // Stryker disable next-line all
     [],
killedBy: JobsTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  🔽
Received:
