[Killed] StringLiteral
main/components/Updates/UpdateTable.js:5:63
 import OurTable from "main/components/OurTable";
 import { yyyyqToQyy } from "main/utils/quarterUtilities.js";
 
-export default function UpdateTable({ updates, testIdPrefix = "UpdateTable" }) {
+export default function UpdateTable({ updates, testIdPrefix = "" }) {
   const columns = [
     {
killedBy: UpdateTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UpdateTable-cell-row-0-col-subjectArea"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ObjectLiteral
main/components/Updates/UpdateTable.js:30:5
       Header: "Errors",
       accessor: "errors",
     },
-    {
-      Header: "Last Update",
-      accessor: "lastUpdate",
-    },
+    {},
   ];
 
killedBy: UpdateTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!
