[Killed] ObjectLiteral
main/components/Updates/UpdateTable.js:10:5
   testIdPrefix = "UpdateTable",
 }) {
   const columns = [
-    {
-      Header: "Subject Area",
-      accessor: "subjectArea",
-    },
+    {},
     {
       Header: "Quarter",
killedBy: UpdateTable tests renders without crashing for empty table with user not logged in
statusReason: Error: A column ID (or string accessor) is required!

[Killed] BlockStatement
main/components/Updates/UpdateTable.js:17:38
     {
       Header: "Quarter",
       accessor: "quarter",
-      Cell: ({ cell: { value } }) => {
-        return yyyyqToQyy(value);
-      },
+      Cell: ({ cell: { value } }) => {},
     },
     {
killedBy: UpdateTable tests Has the expected column headers and content
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  W23
Received:

[Killed] StringLiteral
main/components/Updates/UpdateTable.js:27:17
     },
     {
       Header: "Updated",
-      accessor: "updated",
+      accessor: "",
     },
     {
killedBy: UpdateTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UpdateTable-cell-row-0-col-updated"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Updates/UpdateTable.js:34:15
       accessor: "errors",
     },
     {
-      Header: "Last Update",
+      Header: "",
       accessor: "lastUpdate",
     },
killedBy: UpdateTable tests Has the expected column headers and content
statusReason: TestingLibraryElementError: Unable to find an element with the text: Last Update. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
