[Killed] StringLiteral
main/components/Jobs/JobsTable.js:21:21
       Header: "Status",
       accessor: "status",
     },
-    PlaintextColumn("Log", (cell) => cell.row.original.log),
+    PlaintextColumn("", (cell) => cell.row.original.log),
   ];
 
killedBy: AdminJobsPage tests renders without crashing
statusReason: Error: A column ID (or string accessor) is required!
